uhnp/src/DataProcessors/тн_ДанныеАвтосверкаБуНу/тн_ДанныеАвтосверкаБуНу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>тн_ДанныеАвтосверкаБуНу</name>
  <comment>№000050333</comment>
  <attributes>
    <name>РезультатТД</name>
    <type>
      <types>SpreadsheetDocument</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпоновщикНастроек</name>
    <type>
      <types>DataCompositionSettingsComposer</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеРасшифровки_ERP_УПП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НормативноеВремяОжиданияОтветаСекунд</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеЗапросERP_В_УПП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеОтветERP_От_УПП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Активно_БУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Активно_НУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоОтладка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСверкиНач</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСверкиКон</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательБУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательВал</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказательКол</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазвернутьДоСубсчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазвернутьДоСубконто</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоРасхождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <comment>// Юдина Екатерина 03.02.2026 Выполнение задач №000056622</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

uhnp/src/InformationRegisters/тн_СоответствиеОрганизацииОПиПодразделенияДляСверки/тн_СоответствиеОрганизацииОПиПодразделенияДляСверки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_СоответствиеОрганизацииОПиПодразделенияДляСверки</name>
  <comment>// Юдина Екатерина 03.02.2026 Выполнение задач №000056622</comment>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/тн_НастройкиЗагрузкиДанныхВЕРП/тн_НастройкиЗагрузкиДанныхВЕРП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_НастройкиЗагрузкиДанныхВЕРП</name>
  <comment>//Качикина 14.08.2025 Выполнение задач №000054730</comment>
  <resources>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаВыгрузкиКакОбособленногоПодразделения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/тн_ИДБазРеспондентов/тн_ИДБазРеспондентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>тн_ИДБазРеспондентов</name>
  <comment>Выполнение задач №000042800</comment>
  <predefined>
    <items>
      <name>ЦБ</name>
      <description>ЦБ</description>
    </items>
  </predefined>
  <attributes>
    <name>systemSender</name>
    <comment>ИД базы в сообщениях обмена</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БалансоваяЕдиница</name>
    <comment>Выполнение задач №000044027</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВызыватьПроведениеСПроверкойЗаполненностиРеквизитов</name>
    <comment>Выполнение задач №000046776</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗапретыНаЗагрузку</name>
    <comment>Выполнение задач №000048764</comment>
    <attributes>
      <name>ВидСообщения</name>
      <type>
        <types>EnumRef.тн_ВидыСообщений_ERP_УХ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтруктураКомпании</name>
    <comment>№000050333</comment>
    <attributes>
      <name>Организация</name>
      <comment>№000050333</comment>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РазрешенныеОрганизации</name>
    <comment>//Сафиуллина З.Р. 25.09.2025 Выполнение задач №000055082</comment>
    <attributes>
      <name>ВидСообщения</name>
      <type>
        <types>EnumRef.тн_ВидыСообщений_ERP_УХ</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/DataProcessors/тн_ДанныеАвтосверкаБуНу/Forms/Форма/Module.bsl
#Область Обработчики_Событий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	 		
	ИнициализироватьКомпоновкуДанных();
		
	ДозаполнитьЭлементыФормы();
	ПроставитьАктивностьПоВидуУчета();
	
	// НАЧАЛО Юдина Екатерина 03.02.2026 Выполнение задач №000056622
	УстановитьВидимостьДоступность();  
	// КОНЕЦ Юдина Екатерина 03.02.2026 Выполнение задач №000056622
	
КонецПроцедуры

&НаКлиенте
Процедура ВидУчетаПриИзменении(Элемент)
	
	ПроставитьАктивностьПоВидуУчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодСверкиПриИзменении(Элемент)
	
	Объект.ДатаСверкиНач = ПериодСверки.ДатаНачала;
	Объект.ДатаСверкиКон = ПериодСверки.ДатаОкончания;  
	// НАЧАЛО Юдина Екатерина 03.02.2026 Выполнение задач №000056622  
	Объект.ГоловнаяОрганизация = ПолучитьГоловнуюОрганизацию(Объект.ДатаСверкиНач, Объект.Организация);
	// КОНЕЦ Юдина Екатерина 03.02.2026 Выполнение задач №000056622 

КонецПроцедуры

// Юдина Екатерина 03.02.2026 Выполнение задач №000056622 
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент) 
	
	Объект.ГоловнаяОрганизация = ПолучитьГоловнуюОрганизацию(Объект.ДатаСверкиНач, Объект.Организация);
	
КонецПроцедуры

// Юдина Екатерина 03.02.2026 Выполнение задач №000056622 
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки) 
	
	 Объект.ГоловнаяОрганизация = ПолучитьГоловнуюОрганизацию(Объект.ДатаСверкиНач, Объект.Организация);

КонецПроцедуры

#КонецОбласти 
   
#Область Команды_Формы
 
&НаКлиенте
Процедура ПровестиСверку(Команда)
	
	// Проверка реквизитов
    СтруктураПроверки = ПроверитьЗаполненностьРеквизитов();
	Если Не СтруктураПроверки.РезультатПроверки Тогда	
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтруктураПроверки.СообщениеПользователю);
		Возврат;
	КонецЕсли;
	
	//1. Формируем и отправляем сообщение-запрос	
	ИдентификаторЗапроса = ПолучитьИдентификаторЗапросаДанныхСервер();
	
	ПараметрыСтруктура = Новый Структура();
	ПараметрыСтруктура.Вставить("ИдентификаторЗапроса", ИдентификаторЗапроса);
	ПараметрыСтруктура.Вставить("ИдентификаторФормы", Строка(УникальныйИдентификатор));
	ПараметрыСтруктура.Вставить("ОтправкаЗапроса", Истина);	
	ПараметрыСтруктура.Вставить("КлючМаршрутизации", ВернутьКлючМаршрутизацииОтправкиПоОрганизации(Объект.Организация));
	ПараметрыСтруктура.Вставить("ДатаСверкиНач", ПериодСверки.ДатаНачала);
	ПараметрыСтруктура.Вставить("ДатаСверкиКон", ПериодСверки.ДатаОкончания);
		
	СформироватьСообщениеЗапросНаСервере(ПараметрыСтруктура);
			
	Если ОтправитьСообщениеЗапросСервер(ПараметрыСтруктура) Тогда
		
		ДобавитьЗаписьДанныеАвтосверкаСервер(ПараметрыСтруктура);
		//2. Ожидаем ответа
		
		ДлительнаяОперация = ПолучитьДлительнуюОперациюОжиданияОбработкиОтветногоСообщения(ПараметрыСтруктура);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		Оповещение = Новый ОписаниеОповещения("ПриЗавершенииОбработкиОтветногоСообщения", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИДБазРеспондентов(Команда)
	ОткрытьФорму("Справочник.тн_ИДБазРеспондентов.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкиСопоставленияСчетов(Команда)
	ОткрытьФорму("РегистрСведений.тн_СопоставлениеСчетовУчетаСУПП.ФормаСписка");
КонецПроцедуры

&НаСервере
Процедура ОбработатьОтветОтУППНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	СтруктураОбработка = ОбработкаОбъект.СформироватьСтруктуруОбработкаОтветаНаЗапрос();
		
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОтветОтУПП(Команда)
	ОбработатьОтветОтУППНаСервере();  
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТД(Команда)
	ОбработатьОтветОтУППНаСервере();
КонецПроцедуры

// Юдина Екатерина 03.02.2026 Выполнение задач №000056622 
//
&НаКлиенте
Процедура ОткрытьСоответствиеОрганизацииОПиПодразделенияДляСверки(Команда)
	
	ОткрытьФорму("РегистрСведений.тн_СоответствиеОрганизацииОПиПодразделенияДляСверки.ФормаСписка"); 
	
КонецПроцедуры

#КонецОбласти      

#Область РасшифровкаСКД

&НаКлиенте
Процедура РезультатТДОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначениеРасшифровки(Расшифровка, Элемент.ТекущаяОбласть.Текст, "ДанныеРасшифровки_ERP_УПП");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗначениеРасшифровки(Расшифровка, ТекстовоеЗначениеПоля, ИмяРеквизитаДанныхРасшифровки = Неопределено)
	ЗначениеРасшифровки = ПолучитьЗначениеРасшифровки(Расшифровка, ТекстовоеЗначениеПоля, ИмяРеквизитаДанныхРасшифровки);
	Если ЗначениеРасшифровки <> Неопределено Тогда
		ПоказатьЗначение(,ЗначениеРасшифровки);		
	КонецЕсли	
КонецПроцедуры

&НаСервере
Функция ПолучитьЗначениеРасшифровки(Расшифровка, ТекстПоляРасшифровки, РеквизитРасшифровки)
	СсылкаРасшифровки = Неопределено;
	
	Если РеквизитРасшифровки = Неопределено Тогда

		Если ЗначениеЗаполнено(Объект.ДанныеРасшифровки_ERP_УПП) Тогда
			ТекСсылкаРасшифровки = ПолучитьЗначениеРасшифровкиПоДаннымРасшифровки(Расшифровка, ТекстПоляРасшифровки, "ДанныеРасшифровки_ERP_УПП");	
			Если ТекСсылкаРасшифровки <> Неопределено Тогда
				СсылкаРасшифровки = ТекСсылкаРасшифровки;			
			КонецЕсли;
		КонецЕсли;

	Иначе
		СсылкаРасшифровки = ПолучитьЗначениеРасшифровкиПоДаннымРасшифровки(Расшифровка, ТекстПоляРасшифровки, РеквизитРасшифровки);	
	КонецЕсли;
	
	Возврат СсылкаРасшифровки;
КонецФункции

&НаСервере
Функция ПолучитьЗначениеРасшифровкиПоДаннымРасшифровки(Расшифровка, ТекстПоляРасшифровки, РеквизитРасшифровки)
	СсылкаРасшифровки = Неопределено;
	
	ДанныеРасшифровки = ПолучитьИзВременногоХранилища(Объект[РеквизитРасшифровки]);
	Если Число(Расшифровка) <= ДанныеРасшифровки.Элементы.Количество() - 1 
		И ТипЗнч(ДанныеРасшифровки.Элементы[Расшифровка]) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля")
		И ДанныеРасшифровки.Элементы[Расшифровка].ОсновноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
		
		МассивЗначений = ДанныеРасшифровки.Элементы[Расшифровка].ПолучитьПоля();
		Если МассивЗначений.Количество() > 0 И Строка(МассивЗначений[0].Значение) = ТекстПоляРасшифровки Тогда
			СсылкаРасшифровки = МассивЗначений[0].Значение;		
		КонецЕсли;
	КонецЕсли; 
	
	Возврат СсылкаРасшифровки;
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыФункции       

&НаКлиенте
Функция ПроверитьЗаполненностьРеквизитов()
	
	СтруктураПроверки = Новый Структура;
	СтруктураПроверки.Вставить("РезультатПроверки", Истина);
	СтруктураПроверки.Вставить("СообщениеПользователю", "");
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда 		
		СтруктураПроверки.РезультатПроверки	= Ложь;
		СтруктураПроверки.СообщениеПользователю	= СтруктураПроверки.СообщениеПользователю + "Заполните поле Организация" + Символы.ПС;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ЕстьКлючМаршрутизации = ЗначениеЗаполнено(ВернутьКлючМаршрутизацииОтправкиПоОрганизации(Объект.Организация));
		
		Если Не ЕстьКлючМаршрутизации Тогда
			СтруктураПроверки.РезультатПроверки	= Ложь;
			СтруктураПроверки.СообщениеПользователю	= СтруктураПроверки.СообщениеПользователю + "Не найден ИД-базы по организации в справочнике ""ИД Баз-респондентов""" + Символы.ПС;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПериодСверки.ДатаНачала) Тогда 		
		СтруктураПроверки.РезультатПроверки	= Ложь;
		СтруктураПроверки.СообщениеПользователю	= СтруктураПроверки.СообщениеПользователю + "Заполните дату начала" + Символы.ПС;
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(ПериодСверки.ДатаОкончания) Тогда 		
		СтруктураПроверки.РезультатПроверки	= Ложь;
		СтруктураПроверки.СообщениеПользователю	= СтруктураПроверки.СообщениеПользователю + "Заполните дату окончания" + Символы.ПС;
	КонецЕсли;
	
	ОграничениеМесяцев = 1;
	КолСекунд = 1;
	
	МаксДатаСверки = ДобавитьМесяц(ПериодСверки.ДатаНачала, ОграничениеМесяцев) - КолСекунд;
	Если МаксДатаСверки < ПериодСверки.ДатаОкончания Тогда

		СтруктураПроверки.РезультатПроверки	= Ложь;				
		СтруктураПроверки.СообщениеПользователю	= СтруктураПроверки.СообщениеПользователю + "Максимально возможное количество месяцев сверки: " + ОграничениеМесяцев + Символы.ПС;
	КонецЕсли;
	
	МассивОтбораПоСчетам 	= ПолучитьМассивОтбораПоСчетамНаСервере(); 
	
	Если МассивОтбораПоСчетам.Количество() = 0 Тогда
		СтруктураПроверки.РезультатПроверки	= Ложь;				
		СтруктураПроверки.СообщениеПользователю	= СтруктураПроверки.СообщениеПользователю + "Отбор по счетам не может быть пустым" + Символы.ПС;		
	КонецЕсли;
	
	Возврат СтруктураПроверки;
КонецФункции 

&НаКлиенте
Процедура ПриЗавершенииОбработкиОтветногоСообщения(Результат, ДополнительныеПараметры) Экспорт
	
	//1. Отменено пользователем
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//2. Возникла ошибка
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;	
	КонецЕсли;
	
	ЗаданиеВыполнено = (Результат.Статус = "Выполнено");
		
	//3. Обрабатываем результат
	Если ЗаданиеВыполнено Тогда
		
		СтруктураРезультат = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Объект.СообщениеОтветERP_От_УПП = СтруктураРезультат.Результат;
		
		ОбработатьОтветОтУППНаСервере();
		
		ЭтотОбъект.ТекущийЭлемент = Элементы.ГруппаРезультатСтраница;
	
     КонецЕсли;
   	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьРеквизитыОбъектаИзРезультата(АдресРезультата)
	 
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.РезультатТД = Результат.РезультатТД;
	 
КонецФункции

&НаСервере
Функция ПолучитьДлительнуюОперациюОжиданияПодготовкиРезультатаОтчета(ПараметрыСтруктура)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.Вставить("НормативноеВремяОжиданияОтветаСекунд", Объект.НормативноеВремяОжиданияОтветаСекунд);
	ПараметрыВыполнения.Вставить("ИдентификаторЗапроса", ПараметрыСтруктура.ИдентификаторЗапроса);
	ПараметрыВыполнения.Вставить("СтруктураДанныхОбработки", ПараметрыСтруктура.СтруктураДанныхОбработки);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработка.тн_ДанныеАвтосверкаБуНу.МодульОбъекта.СформироватьСтруктуруОбработкаОтветаНаЗапрос", ПараметрыВыполнения);
	
КонецФункции

&НаСервереБезКонтекста
Функция ВернутьКлючМаршрутизацииОтправкиПоОрганизации(Организация)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	тн_ИДБазРеспондентовСтруктураКомпании.Ссылка КАК Ссылка,
		|	тн_ИДБазРеспондентовСтруктураКомпании.Ссылка.systemSender КАК systemSender
		|ИЗ
		|	Справочник.тн_ИДБазРеспондентов.СтруктураКомпании КАК тн_ИДБазРеспондентовСтруктураКомпании
		|ГДЕ
		|	тн_ИДБазРеспондентовСтруктураКомпании.Организация = &Организация
		|	И НЕ тн_ИДБазРеспондентовСтруктураКомпании.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.systemSender;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИдентификаторЗапросаДанныхСервер()
	
	Возврат Обработки.тн_ДанныеАвтосверкаБуНу.ПолучитьИдентификаторЗапросаДанных();
	
КонецФункции

&НаСервере
Процедура СформироватьСообщениеЗапросНаСервере(ПараметрыСтруктура)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ОбработкаОбъект.СообщениеЗапросERP_В_УПП = ОбработкаОбъект.СформироватьТекстСообщенияЗапросДанных(ПараметрыСтруктура);	
	ОбработкаОбъект.ЭтоОтладка = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ПараметрыСтруктура, "ЭтоОтладка", Ложь);
	
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Функция ОтправитьСообщениеЗапросСервер(ПараметрыСтруктура)
	
	Объект.РезультатТД.Очистить();
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ОтправитьСообщениеЗапрос(ПараметрыСтруктура);
	
КонецФункции

&НаСервере
Процедура ПроставитьАктивностьПоВидуУчета()
	
	Если ВидУчета = 1 Тогда
		Объект.Активно_БУ = Истина;
		Объект.Активно_НУ = Ложь;
	ИначеЕсли ВидУчета = 2 Тогда
		Объект.Активно_БУ = Ложь;
		Объект.Активно_НУ = Истина;
	Иначе
		Объект.Активно_БУ = Ложь;
		Объект.Активно_НУ = Ложь;		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновкуДанных()
	СКД 				= РеквизитФормыВЗначение("Объект").ПолучитьМакет("ERP_СчетОтбор");
	АдресСхемы 			= ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор());
	ИсточникНастроек 	= Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	Объект.КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	Объект.КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
КонецПроцедуры

&НаСервере
Процедура ДозаполнитьЭлементыФормы()
	
	Если Не Объект.Активно_БУ И Не Объект.Активно_НУ Тогда
		ВидУчета = 1;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДобавитьЗаписьДанныеАвтосверкаСервер(ПараметрыСтруктура)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ДобавитьЗаписьДанныеАвтосверка(ПараметрыСтруктура);
	
КонецФункции

&НаСервере
Функция ПолучитьДлительнуюОперациюОжиданияОбработкиОтветногоСообщения(ПараметрыСтруктура)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.Вставить("НормативноеВремяОжиданияОтветаСекунд", Объект.НормативноеВремяОжиданияОтветаСекунд);
	ПараметрыВыполнения.Вставить("ИдентификаторЗапроса", ПараметрыСтруктура.ИдентификаторЗапроса);
	ПараметрыВыполнения.Вставить("ПоДокументам", Ложь);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "Обработки.тн_ДанныеАвтосверкаБуНу.ПолучитьСтруктуруРезультат", ПараметрыВыполнения);
	
КонецФункции

&НаСервере
Функция ПолучитьМассивОтбораПоСчетамНаСервере() 
	ОбработкаОбъект 		= РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ПолучитьМассивОтбораПоСчетам();	
КонецФункции

// Юдина Екатерина 03.02.2026 Выполнение задач №000056622 
//
&НаСервере
Процедура УстановитьВидимостьДоступность()  
	
	Элементы.ГруппаНастройкиСтраница.Видимость = РольДоступна(Метаданные.Роли.тн_ДоступКНастройкамОбработкиДанныеАвтосверкаБУНУ)
		Или РольДоступна(Метаданные.Роли.ПолныеПрава);  
	
КонецПроцедуры

// Юдина Екатерина 03.02.2026 Выполнение задач №000056622 
//
&НаСервереБезКонтекста
Функция ПолучитьГоловнуюОрганизацию(ДатаСверкиНач, Организация)
	
	ГоловнаяОрганизация = Справочники.Организации.ПустаяСсылка(); 
	
	Если ЗначениеЗаполнено(Организация)
		И ЗначениеЗаполнено(ДатаСверкиНач) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	тн_НастройкиЗагрузкиДанныхВЕРП.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	тн_НастройкиЗагрузкиДанныхВЕРП.ДатаНачалаВыгрузкиКакОбособленногоПодразделения КАК ДатаНачалаВыгрузкиКакОбособленногоПодразделения,
		|	1 КАК Приоритет
		|ПОМЕСТИТЬ вт_ДанныеГоловнойОрганизации
		|ИЗ
		|	РегистрСведений.тн_НастройкиЗагрузкиДанныхВЕРП КАК тн_НастройкиЗагрузкиДанныхВЕРП
		|ГДЕ
		|	тн_НастройкиЗагрузкиДанныхВЕРП.Организация = &Организация
		|	И тн_НастройкиЗагрузкиДанныхВЕРП.ГоловнаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|	И тн_НастройкиЗагрузкиДанныхВЕРП.ДатаНачалаВыгрузкиКакОбособленногоПодразделения <> &ПустаяДата
		|	И тн_НастройкиЗагрузкиДанныхВЕРП.ДатаНачалаВыгрузкиКакОбособленногоПодразделения <= &ДатаСверкиНач
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	тн_НастройкиЗагрузкиДанныхВЕРП.ГоловнаяОрганизация,
		|	МИНИМУМ(тн_НастройкиЗагрузкиДанныхВЕРП.ДатаНачалаВыгрузкиКакОбособленногоПодразделения),
		|	2
		|ИЗ
		|	РегистрСведений.тн_НастройкиЗагрузкиДанныхВЕРП КАК тн_НастройкиЗагрузкиДанныхВЕРП
		|ГДЕ
		|	тн_НастройкиЗагрузкиДанныхВЕРП.ГоловнаяОрганизация = &Организация
		|	И тн_НастройкиЗагрузкиДанныхВЕРП.ДатаНачалаВыгрузкиКакОбособленногоПодразделения <> &ПустаяДата
		|
		|СГРУППИРОВАТЬ ПО
		|	тн_НастройкиЗагрузкиДанныхВЕРП.ГоловнаяОрганизация
		|
		|ИМЕЮЩИЕ
		|	МИНИМУМ(тн_НастройкиЗагрузкиДанныхВЕРП.ДатаНачалаВыгрузкиКакОбособленногоПодразделения) <= &ДатаСверкиНач
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вт_ДанныеГоловнойОрганизации.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
		|	МИНИМУМ(вт_ДанныеГоловнойОрганизации.Приоритет) КАК Приоритет
		|ИЗ
		|	вт_ДанныеГоловнойОрганизации КАК вт_ДанныеГоловнойОрганизации
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ДанныеГоловнойОрганизации.ГоловнаяОрганизация";
		
		Запрос.УстановитьПараметр("ДатаСверкиНач", ДатаСверкиНач);  
		Запрос.УстановитьПараметр("Организация",  Организация);
		Запрос.УстановитьПараметр("ПустаяДата", Дата(1,1,1)); 
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда 
			ГоловнаяОрганизация = Выборка.ГоловнаяОрганизация; 
		КонецЕсли;
	КонецЕсли;
	
	Возврат ГоловнаяОрганизация;
	
КонецФункции

#КонецОбласти
